---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.VerticalOffset
source: html/fe847d33-a2bc-7564-df22-1d325a62eab0.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.VerticalOffset Property

Vertical offset of the camera's view center from target, measured at target distance.

## Syntax (C#)
```csharp
public double VerticalOffset { get; set; }
```